app/controllers/clients_controller.rb

SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def myfavs
    @rest_favs ||= []
    current_client.favs.each do |f|
      @rest_favs << Restaurante.find(f.to_i)

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_client
    @client = Client.find(params[:id])