app/controllers/restaurantes_controller.rb

  def index
    @restaurantes = Restaurante.where(:approved => true).order(:name).paginate(page: params[:page], per_page: 4)
---
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."approved" = $1 ORDER BY "restaurantes"."name" ASC LIMIT $2 OFFSET $3  [["approved", true], ["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "restaurantes" WHERE "restaurantes"."approved" = $1  [["approved", true]]

  def set_restaurante
    @restaurante = Restaurante.find(params[:id])
---
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]